beamer-org-mode-demo.org
#+TITLE:     Beamer-Präsentationen mit dem CD der TU Dresden
#+AUTHOR:    Tobias Schlemmer
#+EMAIL:     Tobias.Schlemmer@tu-dresden.de
#+DATE:      7.\,5.~2012
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  de
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:f
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+startup: indent
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation,t]
#+BEAMER_FRAME_LEVEL: 3
##COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+BEAMER_HEADER_EXTRA: \usepackage{amsmath}
#+BEAMER_HEADER_EXTRA: \usepackage{uniinput}
#+BEAMER_HEADER_EXTRA: \usepackage{amsfonts}
#+BEAMER_HEADER_EXTRA: \usepackage{tikz}
#+BEAMER_HEADER_EXTRA: \usepackage[ngerman]{babel}
#+BEAMER_HEADER_EXTRA: \usetikzlibrary{decorations.pathmorphing}
#+BEAMER_HEADER_EXTRA: \usetheme[section,navigation,pagenum,ddc]{tud}
#+BEAMER_HEADER_EXTRA: \useinnertheme[shadow=true]{rounded}
#+BEAMER_HEADER_EXTRA: %\usetheme{Boadilla}
#+BEAMER_HEADER_EXTRA: %\usecolortheme{tud}
#+BEAMER_HEADER_EXTRA: \institut{Institut f\"ur Algebra}%
#+BEAMER_HEADER_EXTRA: \DeclareMathOperator\Orb{Orb}%
#+BEAMER_HEADER_EXTRA: \title[TUD-CD mit \LaTeX\ gesetzt]{Beamer-Präsentationen mit dem CD der TU Dresden}
#+BEAMER_HEADER_EXTRA: \subtitle{TUD-CD mit \LaTeX\ gesetzt}
#+BEAMER_HEADER_EXTRA: \setbeamerfont{description item}{series=\bfseries}
#+BEAMER_HEADER_EXTRA: \setbeamertemplate{date/place in footline}[default][T. Schlemmer]
#+BEAMER_HEADER_EXTRA: \setbeamertemplate{page number in footline}[frame][total]
#+BEAMER_HEADER_EXTRA: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}
#+BEAMER_HEADER_EXTRA: \setlength{\tudbeamerfooterplacewidth}{0.3\linewidth}%
#+BEAMER_HEADER_EXTRA: \setlength{\tudbeamerfooterpagenumwidth}{5em}%
#+BEAMER_HEADER_EXTRA: \makeatletter
#+BEAMER_HEADER_EXTRA: \setlength{\tudbeamerfootertitlewidth}{\paperwidth-\beamer@leftmargin-\beamer@rightmargin
#+BEAMER_HEADER_EXTRA:    -\tudbeamerfooterplacewidth-\tudbeamerfooterpagenumwidth}%
#+BEAMER_HEADER_EXTRA: \makeatother
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC
* Einführung
** Allgemeines
*** Geschichte
- Corporate Design der TU Dresden
- tudbeamer Klasse (mit vielen Nachteilen)
- tud-cd-Paket
- \alert{Konfigurierbarer Beamer-Stil}
*** CD-Vorgaben (Handbuch)
- \textcolor{HKS65K100}{Ränder relativ zu Papiergrüße}
- \textcolor{red}{Schriften in MS Punkt (inkompatible Maßeinheit)}
- \textcolor{red}{Logoposition fehlt}
*** Designkriterien
- Interpretation der Vorgaben
- Abweichend: HKS Farbschema und Univers
- Kombinierbar mit \textbackslash useinnertheme\{rounded\}
- Farbschema mit anderem Layout kombinierbar (partiell implementiert)
- Alle Stile überschreibbar
** Benutzung
*** Beispieldokument                                              :B_example:
:PROPERTIES:
:BEAMER_env: example
:END:
\textbackslash usepackage[ngerman]\{babel\}\\
\textbackslash usetheme[section,navigation]\{tud\}\\
\textbackslash institut{Institut f\"ur Algebra}%
\textbackslash title[Beispiel]{Langer Title mit Beispiel}
\textbackslash begin\{document\}\\
\textbackslash begin\{frame\}\\
\textbackslash maketitle\\
\textbackslash end\{frame\}\\
\textbackslash begin\{frame\}\{Eine Folie\}\\
Inhalt
\textbackslash end\{frame\}\\
\textbackslash end\{document\}\\

* Einstellungen
** \textbackslash usetheme\{tud\}
*** Paketoptionen (Schriften)
- noeulermath :: Benutze keine Euler-Mathematikschriften
- noDIN :: Titel ohne DIN bold
- serifmath :: Nutze Computer Modern für Mathematik
- heavyfont :: Nutze Univers 55 statt Univers 45
- beamerfont :: Keine Fontänderungen
*** Paketoptionen (Seitenstruktur)
- noheader :: Benutze Folien ohne Kopfzeile
- smallrightmargin :: Schmaler rechter Rand (verletzt CD-Richtlinie
- pagenum :: Seitenzahlen in der Fußzeile anzeigen
- section :: mit Abschnittstitel auf jeder Folie
- navbar :: mit Navigationshilfen
- ddc :: mit Dresden-Concept-Logo
- ddcfooter :: mit Dresden-Concept Logo im Fußbereich
** \textbackslash useoutertheme\{tud\}
*** Paketoptionen
- noheader :: Benutze Folien ohne Kopfzeile
- smallrightmargin :: Schmaler rechter Rand (verletzt CD-Richtlinie
- pagenum :: Seitenzahlen in der Fußzeile anzeigen
- section :: mit Abschnittstitel auf jeder Folie
- navbar :: mit Navigationshilfen
- ddc :: mit Dresden-Concept-Logo
- ddcfooter :: mit Dresden-Concept Logo im Fußbereich
*** Makros
- \textbackslash einrichtung\{/einrichtung/\} :: Legt die
 Einrichtung/Fakultät fest
- \textbackslash fachrichtung\{/Fachrichtung/\} :: Legt die
 Fachrichtung fest
- \textbackslash institut\{/Institut/\} :: Legt das
 Institut fest
- \textbackslash professur\{/Professur/\} :: Legt die
 Professur fest
- \textbackslash datecity\{/Datumsort/\} :: Legt den Ort für den Vortrag fest
*** Register
- \textbackslash topmarginnoheader :: Länge, die den Oberen Rand Seitenrand bei
 Kopflosen Folien angibt.
- \textbackslash tudbeamerfooterplacewidth :: Länge, die Breite des
     Datums/Ort/(Autor-)Blockes in der Fußzeile bestimmt
- \textbackslash tudbeamerfooterpagenumwidth :: Länge, die Platz für
     die Seitenzahl in der Fußzeilereserviert
- \textbackslash topmarginnoheader :: Länge, die Platz für den
     Kurztitel in der Fußzeile reserviert
*** Vorlagen                                                        :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_envargs: [allowframebreaks]
:END:
Vorlangen werden mit 
#+LaTeX: \textbf{\textbackslash setbeamertemplate\{\emph{Kategorie}\}[\emph{Vorlage}]} 
gesetzt. Es können neue
definiert und ausgewählt werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).
**** headline                                                       :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Vorlage für Seitenkopf
- tud titlepage :: Titelseitenkopf
- tud header :: normaler Folienkopf
- tud noheader :: Folienkopf für kopflose Folien

**** date/place in footline                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:

- default :: Vorlage für Datum/Ort in Fußzeile mit optionalem Argument
 für Ort. Standardwert „TU Dresden“.

**** short title in footline                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:

- default :: Fügt den Kurztitel in die Fußzeile ein

**** page number in footline                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
\small
- page :: Setzt die Seitenzahl. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total". Für weitere Werte
 siehe unten, Vorlagen, die mit „page number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).
- frame :: Setzt die Foliennummer. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total". Für weitere Werte
 siehe unten, Vorlagen, die mit „frame number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).

*** Vorlagen (Fortsetzung)                                          :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_envargs: [allowframebreaks]
:END:
**** page number: text and total                                 :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** page number: text                                 :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl – Sprachauswahl für Nummer.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

