beamer-org-mode-demo.tex
% Created 2012-08-24 Fr 21:48
\documentclass[presentation,t]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Beamer-Präsentationen mit dem CD der TU Dresden}
\author{Tobias Schlemmer}
\date{7.\,5.~2012}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\usepackage{amsmath}
\usepackage{uniinput}
\usepackage{amsfonts}
\usepackage{tikz}
\usepackage[ngerman]{babel}
\usetikzlibrary{decorations.pathmorphing}
\usetheme[section,navigation,pagenum,ddc]{tud}
\useinnertheme[shadow=true]{rounded}
%\usetheme{Boadilla}
%\usecolortheme{tud}
\institut{Institut f\"ur Algebra}%
\DeclareMathOperator\Orb{Orb}%
\title[TUD-CD mit \LaTeX\ gesetzt]{Beamer-Präsentationen mit dem CD der TU Dresden}
\subtitle{TUD-CD mit \LaTeX\ gesetzt}
\setbeamerfont{description item}{series=\bfseries}
\setbeamertemplate{date/place in footline}[default][T. Schlemmer]
\setbeamertemplate{page number in footline}[frame][total]
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}
\setlength{\tudbeamerfooterplacewidth}{0.3\linewidth}%
\setlength{\tudbeamerfooterpagenumwidth}{5em}%
\makeatletter
\setlength{\tudbeamerfootertitlewidth}{\paperwidth-\beamer@leftmargin-\beamer@rightmargin
-\tudbeamerfooterplacewidth-\tudbeamerfooterpagenumwidth}%
\makeatother
\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}
\section{Einführung}
\label{sec-1}
\subsection{Allgemeines}
\label{sec-1-1}
\begin{frame}
\frametitle{Geschichte}
\label{sec-1-1-1}

\begin{itemize}
\item Corporate Design der TU Dresden
\item tudbeamer Klasse (mit vielen Nachteilen)
\item tud-cd-Paket
\item \alert{Konfigurierbarer Beamer-Stil}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{CD-Vorgaben (Handbuch)}
\label{sec-1-1-2}

\begin{itemize}
\item \textcolor{HKS65K100}{Ränder relativ zu Papiergrüße}
\item \textcolor{red}{Schriften in MS Punkt (inkompatible Maßeinheit)}
\item \textcolor{red}{Logoposition fehlt}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Designkriterien}
\label{sec-1-1-3}

\begin{itemize}
\item Interpretation der Vorgaben
\item Abweichend: HKS Farbschema und Univers
\item Kombinierbar mit \textbackslash useinnertheme\{rounded\}
\item Farbschema mit anderem Layout kombinierbar (partiell implementiert)
\item Alle Stile überschreibbar
\end{itemize}
\end{frame}
\subsection{Benutzung}
\label{sec-1-2}
\begin{frame}
\frametitle{Beispieldokument}
\label{sec-1-2-1}

\textbackslash usepackage[ngerman]\{babel\}\\
\textbackslash usetheme[section,navigation]\{tud\}\\
\textbackslash institut\{Institut f\"ur Algebra\}%
\textbackslash title[Beispiel]\{Langer Title mit Beispiel\}
\textbackslash begin\{document\}\\
\textbackslash begin\{frame\}\\
\textbackslash maketitle\\
\textbackslash end\{frame\}\\
\textbackslash begin\{frame\}\{Eine Folie\}\\
Inhalt
\textbackslash end\{frame\}\\
\textbackslash end\{document\}\\
\end{frame}
\section{Einstellungen}
\label{sec-2}
\subsection{\textbackslash usetheme\{tud\}}
\label{sec-2-1}
\begin{frame}
\frametitle{Paketoptionen (Schriften)}
\label{sec-2-1-1}

\begin{description}
\item[noeulermath] Benutze keine Euler-Mathematikschriften
\item[noDIN] Titel ohne DIN bold
\item[serifmath] Nutze Computer Modern für Mathematik
\item[heavyfont] Nutze Univers 55 statt Univers 45
\item[beamerfont] Keine Fontänderungen
\end{description}
\end{frame}
\begin{frame}
\frametitle{Paketoptionen (Seitenstruktur)}
\label{sec-2-1-2}

\begin{description}
\item[noheader] Benutze Folien ohne Kopfzeile
\item[smallrightmargin] Schmaler rechter Rand (verletzt CD-Richtlinie
\item[pagenum] Seitenzahlen in der Fußzeile anzeigen
\item[section] mit Abschnittstitel auf jeder Folie
\item[navbar] mit Navigationshilfen
\item[ddc] mit Dresden-Concept-Logo
\item[ddcfooter] mit Dresden-Concept Logo im Fußbereich
\end{description}
\end{frame}
\subsection{\textbackslash useoutertheme\{tud\}}
\label{sec-2-2}
\begin{frame}
\frametitle{Paketoptionen}
\label{sec-2-2-1}

\begin{description}
\item[noheader] Benutze Folien ohne Kopfzeile
\item[smallrightmargin] Schmaler rechter Rand (verletzt CD-Richtlinie
\item[pagenum] Seitenzahlen in der Fußzeile anzeigen
\item[section] mit Abschnittstitel auf jeder Folie
\item[navbar] mit Navigationshilfen
\item[ddc] mit Dresden-Concept-Logo
\item[ddcfooter] mit Dresden-Concept Logo im Fußbereich
\end{description}
\end{frame}
\begin{frame}
\frametitle{Makros}
\label{sec-2-2-2}

\begin{description}
\item[\textbackslash einrichtung\{\emph{einrichtung}\}] Legt die
 Einrichtung/Fakultät fest
\item[\textbackslash fachrichtung\{\emph{Fachrichtung}\}] Legt die
 Fachrichtung fest
\item[\textbackslash institut\{\emph{Institut}\}] Legt das
 Institut fest
\item[\textbackslash professur\{\emph{Professur}\}] Legt die
 Professur fest
\item[\textbackslash datecity\{\emph{Datumsort}\}] Legt den Ort für den Vortrag fest
\end{description}
\end{frame}
\begin{frame}
\frametitle{Register}
\label{sec-2-2-3}

\begin{description}
\item[\textbackslash topmarginnoheader] Länge, die den Oberen Rand Seitenrand bei
 Kopflosen Folien angibt.
\item[\textbackslash tudbeamerfooterplacewidth] Länge, die Breite des
     Datums/Ort/(Autor-)Blockes in der Fußzeile bestimmt
\item[\textbackslash tudbeamerfooterpagenumwidth] Länge, die Platz für
     die Seitenzahl in der Fußzeilereserviert
\item[\textbackslash topmarginnoheader] Länge, die Platz für den
     Kurztitel in der Fußzeile reserviert
\end{description}
\end{frame}
\begin{frame}[allowframebreaks]
\frametitle{Vorlagen}
\label{sec-2-2-4}

Vorlangen werden mit 
\textbf{\textbackslash setbeamertemplate\{\emph{Kategorie}\}[\emph{Vorlage}]} 
gesetzt. Es können neue
definiert und ausgewählt werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).
\begin{block}{headline}
\label{sec-2-2-4-1}

Vorlage für Seitenkopf
\begin{description}
\item[tud titlepage] Titelseitenkopf
\item[tud header] normaler Folienkopf
\item[tud noheader] Folienkopf für kopflose Folien
\end{description}
\end{block}
\begin{block}{date/place in footline}
\label{sec-2-2-4-2}


\begin{description}
\item[default] Vorlage für Datum/Ort in Fußzeile mit optionalem Argument
 für Ort. Standardwert „TU Dresden“.
\end{description}
\end{block}
\begin{block}{short title in footline}
\label{sec-2-2-4-3}


\begin{description}
\item[default] Fügt den Kurztitel in die Fußzeile ein
\end{description}
\end{block}
\begin{block}{page number in footline}
\label{sec-2-2-4-4}

\small
\begin{description}
\item[page] Setzt die Seitenzahl. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total''. Für weitere Werte
 siehe unten, Vorlagen, die mit „page number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).
\item[frame] Setzt die Foliennummer. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total''. Für weitere Werte
 siehe unten, Vorlagen, die mit „frame number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).
\end{description}
\end{block}
\end{frame}
\begin{frame}[allowframebreaks]
\frametitle{Vorlagen (Fortsetzung)}
\label{sec-2-2-5}
\begin{block}{page number: text and total}
\label{sec-2-2-5-1}

Setzt Seitenzahl – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
\begin{description}
\item[english] Englisch
\item[german] Deutsch
\end{description}
\end{block}
\begin{block}{page number: text}
\label{sec-2-2-5-2}

Setzt Seitenzahl – Sprachauswahl für Nummer.(wird automatisch gesetzt)
\begin{description}
\item[english] Englisch
\item[german] Deutsch
\end{description}
\end{block}
