beamer-org-mode-demo.org
**** page number: total                                             :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** page number: only                                              :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl ohne Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** frame number: text and total                                   :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** frame number: text                                   :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer – Sprachauswahl für Nummer.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** frame number: total                                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** frame number: only                                             :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer ohne  Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung


**** footline                                                       :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt den Seitenfuß

- tud titlepage :: Fußzeile auf der Titelseite
- tud pagenum :: Fußzeile mit Seiten- oder Folienzahl entsprechend dem
   Parameter zu „page number in footline“
- tud nopagenum :: Fußzeile ohne Seiten- und Folienzahl

**** frametitle                                                  :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt den Folientitel
- tud titlesection :: Setzt vor dem eigentlichen Titel den
Abschnittstitel
- tud notitlesection :: Es wird nur der 

*** Beispiel

  #+BEGIN_LATEX
    \textbackslash setbeamercolor\{normal text\}\{bg=white\}\\
    \textbackslash setbeamertemplate\{headline\}[tud header]\\
    \textbackslash setbeamertemplate\{footline\}[tud pagenum]\\
    \textbackslash setbeamertemplate\{frametitle\}[tud notitlesection]\\
  #+END_LATEX
 

** \textbackslash usefonttheme\{tud\}

*** Paketoptionen
- noeulermath :: Benutze keine Euler-Mathematikschriften
- noDIN :: Titel ohne DIN bold
- nodin :: Titel ohne DIN bold
- serifmath :: Nutze Computer Modern für Mathematik
- heavyfont :: Nutze Univers 55 statt Univers 45
- beamerfont :: Keine Fontänderungen

*** Makros
- \textbackslash tudtitlenormalsize :: Ersatz für \textbackslash
  normalsize auf der Titelseite
- \textbackslash tudtitlesmall :: Ersatz für \textbackslash small auf der Titelseite
- \textbackslash tudtitletiny :: Ersatz für \textbackslash tiny auf der Titelseite

Darüberhinaus lädt dieses Paket das Paket „tudfonts“ mit all seinen makros

*** Schriftvorlagen                                               :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_envargs: [allowframebreaks]
:END:
Vorlangen werden mit \textbackslash
setbeamerfont\{/Name/\}\{Werte\} gesetzt. Sie können mit \textbackslash
usebeamerfont aktiviert werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).

Es werden folgende Vorlagen definiert:
-  \textbackslash setbeamerfont\{itemize/enumerate subbody\} \{size=\textbackslash scriptsize\}
-  \textbackslash setbeamerfont\{itemize/enumerate subsubbody\} \{size=\textbackslash scriptsize\}
-  \textbackslash setbeamerfont\{section in head/foot\}\{size=\textbackslash normalsize, family=\textbackslash sffamily\}
-  \textbackslash setbeamerfont\{frametitle\} \{size=\textbackslash normalsize, family=\textbackslash sffamily\}
-  \textbackslash setbeamerfont\{framesubtitle\} \{size=\textbackslash
   small, series=\textbackslash bfseries,family=\textbackslash sffamily\}
-  \textbackslash setbeamerfont\{footline\} \{size=\textbackslash tiny\}
-  \textbackslash setbeamerfont\{block title\} \{size=\{\}\}
-  \textbackslash if@noDIN
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash sffamily\}
  \textbackslash else
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash dinfamily\}
  \textbackslash fi
-  \textbackslash setbeamerfont\{subtitle\} \{series=\textbackslash
   bfseries, family=\textbackslash sffamily\}
-  \textbackslash setbeamerfont\{einrichtung/titlepage\}
   \{size=\textbackslash tudtitletiny, series=\textbackslash bfseries\}
-  \textbackslash setbeamerfont\{fachrichtung/titlepage\} \{size=\textbackslash tudtitletiny\}
-  \textbackslash setbeamerfont\{institut/titlepage\} \{parent=fachrichtung/titlepage\}
-  \textbackslash setbeamerfont\{professur/titlepage\} \{parent=fachrichtung/titlepage\}
-  \textbackslash setbeamerfont\{date in head/foot/titlepage\} \{size=\textbackslash tudtitlenormalsize\}
-  \textbackslash setbeamerfont\{author\} \{size=\textbackslash tudtitlesmall\}  



** \textbackslash usecolortheme\{tud\}

*** Makros
- \textbackslash darktitlepale :: Stellt eine dunkle Titelseite ein, wie
vom CD gefordert
- \textbackslash whitetitlepage :: Titelseite wird weiß (nicht CD-Konform).

Darüberhinaus lädt dieses Paket das Paket „tudcolors“ mit all seinen
makros und den HKS-Farben (siehe Dokumentation von tudmathposter)

