beamer-org-mode-demo.tex
\begin{block}{page number: total}
\label{sec-2-2-5-3}

Setzt Seitenzahl und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[default] Standardeinstellung
\end{description}
\end{block}
\begin{block}{page number: only}
\label{sec-2-2-5-4}

Setzt Seitenzahl ohne Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[default] Standardeinstellung
\end{description}
\end{block}
\begin{block}{frame number: text and total}
\label{sec-2-2-5-5}

Setzt Foliennummer – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
\begin{description}
\item[english] Englisch
\item[german] Deutsch
\end{description}
\end{block}
\begin{block}{frame number: text}
\label{sec-2-2-5-6}

Setzt Foliennummer – Sprachauswahl für Nummer.(wird automatisch gesetzt)
\begin{description}
\item[english] Englisch
\item[german] Deutsch
\end{description}
\end{block}
\begin{block}{frame number: total}
\label{sec-2-2-5-7}

Setzt Foliennummer und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[default] Standardeinstellung
\end{description}
\end{block}
\begin{block}{frame number: only}
\label{sec-2-2-5-8}

Setzt Foliennummer ohne  Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[default] Standardeinstellung
\end{description}
\end{block}
\begin{block}{footline}
\label{sec-2-2-5-9}

Setzt den Seitenfuß

\begin{description}
\item[tud titlepage] Fußzeile auf der Titelseite
\item[tud pagenum] Fußzeile mit Seiten- oder Folienzahl entsprechend dem
   Parameter zu „page number in footline“
\item[tud nopagenum] Fußzeile ohne Seiten- und Folienzahl
\end{description}
\end{block}
\begin{block}{frametitle}
\label{sec-2-2-5-10}

Setzt den Folientitel
\begin{description}
\item[tud titlesection] Setzt vor dem eigentlichen Titel den
\end{description}
Abschnittstitel
\begin{description}
\item[tud notitlesection] Es wird nur der
\end{description}
\end{block}
\end{frame}
\begin{frame}
\frametitle{Beispiel}
\label{sec-2-2-6}


    \textbackslash setbeamercolor\{normal text\}\{bg=white\}\\
    \textbackslash setbeamertemplate\{headline\}[tud header]\\
    \textbackslash setbeamertemplate\{footline\}[tud pagenum]\\
    \textbackslash setbeamertemplate\{frametitle\}[tud notitlesection]\\
 
\end{frame}
\subsection{\textbackslash usefonttheme\{tud\}}
\label{sec-2-3}
\begin{frame}
\frametitle{Paketoptionen}
\label{sec-2-3-1}

\begin{description}
\item[noeulermath] Benutze keine Euler-Mathematikschriften
\item[noDIN] Titel ohne DIN bold
\item[nodin] Titel ohne DIN bold
\item[serifmath] Nutze Computer Modern für Mathematik
\item[heavyfont] Nutze Univers 55 statt Univers 45
\item[beamerfont] Keine Fontänderungen
\end{description}
\end{frame}
\begin{frame}
\frametitle{Makros}
\label{sec-2-3-2}

\begin{description}
\item[\textbackslash tudtitlenormalsize] Ersatz für \textbackslash
  normalsize auf der Titelseite
\item[\textbackslash tudtitlesmall] Ersatz für \textbackslash small auf der Titelseite
\item[\textbackslash tudtitletiny] Ersatz für \textbackslash tiny auf der Titelseite
\end{description}

Darüberhinaus lädt dieses Paket das Paket „tudfonts“ mit all seinen makros
\end{frame}
\begin{frame}[allowframebreaks]
\frametitle{Schriftvorlagen}
\label{sec-2-3-3}

Vorlangen werden mit \textbackslash
setbeamerfont\{\emph{Name}\}\{Werte\} gesetzt. Sie können mit \textbackslash
usebeamerfont aktiviert werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).

Es werden folgende Vorlagen definiert:
\begin{itemize}
\item \textbackslash setbeamerfont\{itemize/enumerate subbody\} \{size=\textbackslash scriptsize\}
\item \textbackslash setbeamerfont\{itemize/enumerate subsubbody\} \{size=\textbackslash scriptsize\}
\item \textbackslash setbeamerfont\{section in head/foot\}\{size=\textbackslash normalsize, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{frametitle\} \{size=\textbackslash normalsize, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{framesubtitle\} \{size=\textbackslash
   small, series=\textbackslash bfseries,family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{footline\} \{size=\textbackslash tiny\}
\item \textbackslash setbeamerfont\{block title\} \{size=\{\}\}
\item \textbackslash if@noDIN
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash sffamily\}
  \textbackslash else
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash dinfamily\}
  \textbackslash fi
\item \textbackslash setbeamerfont\{subtitle\} \{series=\textbackslash
   bfseries, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{einrichtung/titlepage\}
   \{size=\textbackslash tudtitletiny, series=\textbackslash bfseries\}
\item \textbackslash setbeamerfont\{fachrichtung/titlepage\} \{size=\textbackslash tudtitletiny\}
\item \textbackslash setbeamerfont\{institut/titlepage\} \{parent=fachrichtung/titlepage\}
\item \textbackslash setbeamerfont\{professur/titlepage\} \{parent=fachrichtung/titlepage\}
\item \textbackslash setbeamerfont\{date in head/foot/titlepage\} \{size=\textbackslash tudtitlenormalsize\}
\item \textbackslash setbeamerfont\{author\} \{size=\textbackslash tudtitlesmall\}
\end{itemize}
\end{frame}
\subsection{\textbackslash usecolortheme\{tud\}}
\label{sec-2-4}
\begin{frame}
\frametitle{Makros}
\label{sec-2-4-1}

\begin{description}
\item[\textbackslash darktitlepale] Stellt eine dunkle Titelseite ein, wie
\end{description}
vom CD gefordert
\begin{description}
\item[\textbackslash whitetitlepage] Titelseite wird weiß (nicht CD-Konform).
\end{description}

Darüberhinaus lädt dieses Paket das Paket „tudcolors“ mit all seinen
makros und den HKS-Farben (siehe Dokumentation von tudmathposter)
\end{frame}
