beamer-org-mode-demo.org
*** Farbvorlagen                                                    :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_envargs: [allowframebreaks]
:END:
Farbvorlagen werden mit \textbackslash
setbeamercolor\{/Name/\}\{Werte\} gesetzt. Sie können mit \textbackslash
usebeamercolor für die Aktivierung geladen werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).

Es werden folgende Vorlagen definiert:
-  \textbackslash setbeamercolor\{normal text\} \{fg=HKS41K100,bg=white\}
-  \textbackslash setbeamercolor\{structure\} \{fg=HKS41K100\}
-  \textbackslash setbeamercolor\{alerted text\} \{fg=HKS44K100\}
-  \textbackslash setbeamercolor\{alternate palette\} \{fg=HKS92K80\}
-  \textbackslash setbeamercolor\{date in head/foot\} \{parent=alternate palette\}
-  \textbackslash setbeamercolor\{title in head/foot\} \{parent=alternate palette\}
-  \textbackslash setbeamercolor\{page number in head/foot\} \{parent=alternate palette\}
-  \textbackslash setbeamercolor\{section in head/foot\} \{parent=alternate palette\}
-  \textbackslash setbeamercolor\{subsection in head/foot\} \{parent=section in head/foot\}
-  \textbackslash setbeamercolor\{upper separation line head\} \{parent=alternate palette\}
-  \textbackslash setbeamercolor\{lower separation line head\} \{parent=upper separation line head\}
-  \textbackslash setbeamercolor\{author in head/foot\} \{parent=section in head/foot\}
-  \textbackslash setbeamercolor\{title in head/foot\} \{parent=subsection in head/foot\}
-  \textbackslash setbeamercolor\{logo\} \{use=structure, fg=structure.fg\}
-  \textbackslash newcommand*\{\textbackslash darktitlepage\}\{%
  -  \textbackslash setbeamercolor\{normal text/titlepage\} \{fg=white,bg=HKS41K100\}%
  -  \textbackslash setbeamercolor\{title\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{einrichtung/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage, fg=upper separation line head/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{date in head/foot/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ white
  -  \textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ whitef
     \}
-  \textbackslash newcommand*\{\textbackslash whitetitlepage\}\{%
  -   \textbackslash setbeamercolor\{normal text/titlepage\}
      \{use=normal text,fg=normal text.fg, bg=normal text.bg\}
  - \textbackslash setbeamercolor\{title\} \{use=normal
    text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepagexo, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{einrichtung/titlepage\} \{fg=HKS92K100\}%
  -  \textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{fg=HKS92K100\}%
  -  \textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage,fg=upper separation line
        head/titlepage.fg\}%
  -  \textbackslash setbeamercolor\{date in head/foot/titlepage\} \{fg=HKS92K100\}%
  -  \textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ bunt%
  -  \textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ colorf
     \}
-  \textbackslash darktitlepage
  
-  \textbackslash setbeamercolor\{block body\} \{use=normal text,
   fg=normal text.fg, bg=HKS41K10\}
-  \textbackslash setbeamercolor\{block title\} \{fg=HKS41K100,bg=HKS41K20\}
-  \textbackslash setbeamercolor\{block body example\} \{use=normal
   text, fg=normal text.fg, bg=HKS41K10\}
-  \textbackslash setbeamercolor\{block title example\}
   \{fg=HKS57K100, bg=HKS41K20\}
-  \textbackslash setbeamercolor\{block body alerted\} \{use=normal
   text, fg=normal text.fg, bg=HKS65K10\}
-  \textbackslash setbeamercolor\{block title alerted\}
   \{fg=HKS07K100, bg=HKS65K20\}



** \textbackslash useinnertheme\{tud\}

*** Vorlagen                                                        :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_envargs: [allowframebreaks]
:END:
Für die inneren Vorlagen gibt es keine Vorgaben außer für die
Titelseite.
**** Verwendete Vorlagen/Makros                                  :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
- \textbackslash beamertemplatedotitem :: siehe beamer-Dokumentation
- \textbackslash usesubitemizeitemtemplate\{-\/-\} :: siehe
     beamer-Dokumentation
- \textbackslash setbeamertemplate\{title page\}[tud] :: stellt das CD
     der TUD für die Titelseite ein. Dieses Makro wird automatisch mit
     \textbackslash begin \{document\} aufgerufen.

** Tips:
*** Fußzeile
Die Fußzeile sollte die wichtigsten Informationen enthalten, an die
sich das Publikum erinnern soll. Wenn das TU-Logo im Kopf enthalten
ist die Angabe „TU Dresden“ redundant.

\textbackslash setbeamertemplate\{date/place in
footline\}[default][I. Nachname] 

Setzt statt der TU Dresden den Namen
des Sprechers.
*** Blöcke mit runden Ecken und Schatten
**** Aufruf                                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Blöcke wie dieser hier werden mittels 

\textbackslash useinnertheme[shadow=true]\{rounded\}

in der Dokumentpräambel voreingestellt
** Ein Beispiel    
*** Eine Beispielfolie                                              
**** 0.3                                                       :B_columns:
:PROPERTIES:
:BEAMER_env: columns
:END:
