beamer-org-mode-demo.tex
\begin{frame}[allowframebreaks]
\frametitle{Farbvorlagen}
\label{sec-2-4-2}

Farbvorlagen werden mit \textbackslash
setbeamercolor\{\emph{Name}\}\{Werte\} gesetzt. Sie können mit \textbackslash
usebeamercolor für die Aktivierung geladen werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).

Es werden folgende Vorlagen definiert:
\begin{itemize}
\item \textbackslash setbeamercolor\{normal text\} \{fg=HKS41K100,bg=white\}
\item \textbackslash setbeamercolor\{structure\} \{fg=HKS41K100\}
\item \textbackslash setbeamercolor\{alerted text\} \{fg=HKS44K100\}
\item \textbackslash setbeamercolor\{alternate palette\} \{fg=HKS92K80\}
\item \textbackslash setbeamercolor\{date in head/foot\} \{parent=alternate palette\}
\item \textbackslash setbeamercolor\{title in head/foot\} \{parent=alternate palette\}
\item \textbackslash setbeamercolor\{page number in head/foot\} \{parent=alternate palette\}
\item \textbackslash setbeamercolor\{section in head/foot\} \{parent=alternate palette\}
\item \textbackslash setbeamercolor\{subsection in head/foot\} \{parent=section in head/foot\}
\item \textbackslash setbeamercolor\{upper separation line head\} \{parent=alternate palette\}
\item \textbackslash setbeamercolor\{lower separation line head\} \{parent=upper separation line head\}
\item \textbackslash setbeamercolor\{author in head/foot\} \{parent=section in head/foot\}
\item \textbackslash setbeamercolor\{title in head/foot\} \{parent=subsection in head/foot\}
\item \textbackslash setbeamercolor\{logo\} \{use=structure, fg=structure.fg\}
\item \textbackslash newcommand*\{\textbackslash darktitlepage\}\{%
\begin{itemize}
\item \textbackslash setbeamercolor\{normal text/titlepage\} \{fg=white,bg=HKS41K100\}%
\item \textbackslash setbeamercolor\{title\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{einrichtung/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage, fg=upper separation line head/titlepage.fg\}%
\item \textbackslash setbeamercolor\{date in head/foot/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ white
\item \textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ whitef
     \}
\end{itemize}
\item \textbackslash newcommand*\{\textbackslash whitetitlepage\}\{%
\begin{itemize}
\item \textbackslash setbeamercolor\{normal text/titlepage\}
      \{use=normal text,fg=normal text.fg, bg=normal text.bg\}
\item \textbackslash setbeamercolor\{title\} \{use=normal
    text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepagexo, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%
\item \textbackslash setbeamercolor\{einrichtung/titlepage\} \{fg=HKS92K100\}%
\item \textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%
\item \textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{fg=HKS92K100\}%
\item \textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage,fg=upper separation line
        head/titlepage.fg\}%
\item \textbackslash setbeamercolor\{date in head/foot/titlepage\} \{fg=HKS92K100\}%
\item \textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ bunt\%
\item \textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ colorf
     \}
\end{itemize}
\item \textbackslash darktitlepage
\item \textbackslash setbeamercolor\{block body\} \{use=normal text,
   fg=normal text.fg, bg=HKS41K10\}
\item \textbackslash setbeamercolor\{block title\} \{fg=HKS41K100,bg=HKS41K20\}
\item \textbackslash setbeamercolor\{block body example\} \{use=normal
   text, fg=normal text.fg, bg=HKS41K10\}
\item \textbackslash setbeamercolor\{block title example\}
   \{fg=HKS57K100, bg=HKS41K20\}
\item \textbackslash setbeamercolor\{block body alerted\} \{use=normal
   text, fg=normal text.fg, bg=HKS65K10\}
\item \textbackslash setbeamercolor\{block title alerted\}
   \{fg=HKS07K100, bg=HKS65K20\}
\end{itemize}
\end{frame}
\subsection{\textbackslash useinnertheme\{tud\}}
\label{sec-2-5}
\begin{frame}[allowframebreaks]
\frametitle{Vorlagen}
\label{sec-2-5-1}

Für die inneren Vorlagen gibt es keine Vorgaben außer für die
Titelseite.
\begin{block}{Verwendete Vorlagen/Makros}
\label{sec-2-5-1-1}

\begin{description}
\item[\textbackslash beamertemplatedotitem] siehe beamer-Dokumentation
\item[\textbackslash usesubitemizeitemtemplate\{-\/-\}] siehe
     beamer-Dokumentation
\item[\textbackslash setbeamertemplate\{title page\}[tud]] stellt das CD
     der TUD für die Titelseite ein. Dieses Makro wird automatisch mit
     \textbackslash begin \{document\} aufgerufen.
\end{description}
\end{block}
\end{frame}
\subsection{Tips:}
\label{sec-2-6}
\begin{frame}
\frametitle{Fußzeile}
\label{sec-2-6-1}

Die Fußzeile sollte die wichtigsten Informationen enthalten, an die
sich das Publikum erinnern soll. Wenn das TU-Logo im Kopf enthalten
ist die Angabe „TU Dresden“ redundant.

\textbackslash setbeamertemplate\{date/place in
footline\}[default][I. Nachname] 

Setzt statt der TU Dresden den Namen
des Sprechers.
\end{frame}
\begin{frame}
\frametitle{Blöcke mit runden Ecken und Schatten}
\label{sec-2-6-2}
\begin{block}{Aufruf}
\label{sec-2-6-2-1}

Blöcke wie dieser hier werden mittels 

\textbackslash useinnertheme[shadow=true]\{rounded\}

in der Dokumentpräambel voreingestellt
\end{block}
\end{frame}
\subsection{Ein Beispiel}
\label{sec-2-7}
\begin{frame}
\frametitle{Eine Beispielfolie}
\label{sec-2-7-1}
\begin{columns} % 0.3
\label{sec-2-7-1-1}
\begin{column}{0.3\textwidth}
\label{sec-2-7-1-1-1}
