beamer-org-mode-demo.org
***** 0.3                                                      :B_column:
:PROPERTIES:
:BEAMER_env: column
:END:
#+BEGIN_LATEX
  \tikzstyle{automorphismuspfeil}=[->,HKS44K100,decoration={bent,aspect=0.3,amplitude=3},decorate]
  \tikzstyle{automorphismuspfeil2}=[automorphismuspfeil,decoration={bent,aspect=0.3,amplitude=2}]
  \begin{tikzpicture}
  \draw (0,0) node (n0) {0};
  \draw (-1,1) node (n1) {1};
  \draw (1,1) node (n2) {2};
  \draw (-1.5,2) node (n3) {3};
  \draw (-0.5,2) node (n4) {4};
  \draw (0.5,2) node (n5) {5};
  \draw (1.5,2) node (n6) {6};
  \draw (0,3) node (n7) {7};
  \draw (n0) -- (n1) -- (n3) -- (n7) -- (n6) -- (n2) -- (n0);
  \draw (n1) -- (n4) -- (n7) -- (n5) -- (n2);
  \only<1,2,5,6> {
    \draw[automorphismuspfeil] (n1) -- (n2);
    \draw[automorphismuspfeil] (n2) -- (n1); 
  }
  \only<3,4>{
    \draw[automorphismuspfeil] (n3) -- (n4);
    \draw[automorphismuspfeil] (n4) -- (n3);
  }
  \only<5>{
    \draw[automorphismuspfeil] (n3) -- (n5);
    \draw[automorphismuspfeil] (n5) -- (n3);
  }
  \only<6>{
    \draw[automorphismuspfeil] (n3) -- (n6);
    \draw[automorphismuspfeil] (n6) -- (n3);
  }
  \only<6>{
    \draw[automorphismuspfeil2] (n4) -- (n5);
    \draw[automorphismuspfeil2] (n5) -- (n4);
  }
  \only<5>{
    \draw[automorphismuspfeil] (n4) -- (n6);
    \draw[automorphismuspfeil] (n6) -- (n4);
  }
  \only<3,4>{
    \draw[automorphismuspfeil] (n5) -- (n6);
    \draw[automorphismuspfeil] (n6) -- (n5);
  }
  \only<1>{
    \draw[automorphismuspfeil] (n3) -- (n5);
    \draw[automorphismuspfeil2] (n5) -- (n4);
    \draw[automorphismuspfeil] (n4) -- (n6);
    \draw[automorphismuspfeil] (n6) -- (n3);
  }
  \only<2>{
    \draw[automorphismuspfeil] (n3) -- (n6);
    \draw[automorphismuspfeil] (n6) -- (n4);
    \draw[automorphismuspfeil2] (n4) -- (n5);
    \draw[automorphismuspfeil] (n5) -- (n3);
  }
  \end{tikzpicture}
  
#+END_LATEX
***** Beschreibung                                        :B_block:BMCOL:
:PROPERTIES:
:BEAMER_env: block
:BEAMER_envargs: c<1-7>
:BEAMER_col: 0.7
:END:

Eine Tabelle

#+BEAMER: {}\uncover<2->{\tiny %}
|------------------+-----+-----+-----+-----+-----+-----+-----+-----|
|                  | $1$ | $a$ | $b$ | $c$ | $d$ | $e$ | $f$ | $g$ |
|------------------+-----+-----+-----+-----+-----+-----+-----+-----|
| $1=(1)$          | $1$ | $a$ | $b$ | $c$ | $d$ | $e$ | $f$ | $g$ |
| $a=(34)$         | $a$ | $1$ | $c$ | $b$ | $g$ | $f$ | $e$ | $d$ |
| $b=(56)$         | $b$ | $c$ | $1$ | $a$ | $f$ | $g$ | $d$ | $e$ |
| $c=(34)(56)$     | $c$ | $b$ | $a$ | $1$ | $e$ | $d$ | $g$ | $f$ |
| $d=(12)(35)(46)$ | $d$ | $f$ | $g$ | $e$ | $1$ | $c$ | $a$ | $b$ |
| $e=(12)(36)(45)$ | $e$ | $g$ | $f$ | $d$ | $c$ | $1$ | $b$ | $a$ |
| $f=(12)(3546)$   | $f$ | $d$ | $e$ | $g$ | $b$ | $a$ | $c$ | $1$ |
| $g=(12)(3645)$   | $g$ | $e$ | $d$ | $f$ | $a$ | $b$ | $1$ | $c$ |
|------------------+-----+-----+-----+-----+-----+-----+-----+-----|
#+BEAMER: }


* Minimal agierende Automorphismen
** Quasiordnung der Automorphismen
*** Ein Satz mit Beweis
**** Quasiordnung                                              :B_theorem:
:PROPERTIES:
:BEAMER_env: theorem
:BEAMER_envargs: <1->
:END:
Sei $G\leq \mathfrak{Aut}(M,\leq)$ eine Untergruppe der geordneten
Menge $(M,\leq)$. Dann ist die Relation ${\sqsubseteq}\subseteq
G\times G$ mit 
\[
g\sqsubseteq h :\Leftrightarrow ∀u∈\Orb(〈g〉)∃U'∈\Orb(〈h〉)\text{ und }U\subseteq U'
\]
eine Quasiordnung.

**** Beweis                                              :B_ignoreheading:
:PROPERTIES:
:BEAMER_env: proof
:BEAMER_envargs: <1>
:END:
1. Reflexiv: $\Orb(〈g〉) = \Orb(〈g〉)$
2. Transitiv: 
#+BEGIN_LATEX
  \[
  \begin{matrix}∀U∈\Orb(〈g〉)∃U'∈\Orb(〈h〉): U\subseteq U'\\
    ∀V∈\Orb(〈h〉)∃V'∈\Orb(〈i〉): V\subseteq V'
  \end{matrix}\quad ⇒\quad ∃U''∈\Orb(〈f〉): U\subseteq U''.
  \]\vspace{-0.25\baselineskip}
#+END_LATEX
*** Beispielfolie                                               :B_example:
:PROPERTIES:
:BEAMER_env: example
:END:
**** Beispieltitel                                             :B_example:
:PROPERTIES:
:BEAMER_env: example
:END:
 mal sehen, was wird
**** Block hervorgehoben                                    :B_alertblock:
:PROPERTIES:
:BEAMER_env: alertblock
:END:
Inhalt

